<b>Objectifs:</b>

En utilisant la bibliothèque pandas, savoir :
- Manipuler les series 
- Manipuler les dataframes

In [48]:
# Importer pandas
import pandas as pd

<b>Series pour représenter un individu</b>

Création

On peut créer une série qui regroupe les informations d'une personne.

Une série est crée comme un objet de la classe `pd.Series` :
- en utilisant un dictionnaire

Exemple: 

        s_employe=pd.Series({'nom':"Ali",'salaire':1200.56,'age':28} , 
                    name='etudiant')

- en utilisant une liste

Exemple: 

        s_employe=pd.Series(["Ali",1200.56,28] , 
                        index=['nom','salaire','age'], 
                        name='etudiant')

In [49]:
# En utilisant un dictionnaire
s_employe=#?

nom            Ali
salaire    1200.56
age             28
Name: etudiant, dtype: object

In [50]:
# En utilisant des listes
s_employe=#?

nom            Ali
salaire    1200.56
age             28
Name: etudiant, dtype: object

Propriétés de Series

In [136]:
s_employe.dtype

dtype('O')

In [137]:
s_employe.shape

(3,)

In [138]:
# index
s_employe.index

Index(['nom', 'salaire', 'age'], dtype='object')

In [54]:
s_employe.name

'etudiant'

In [55]:
# convertir en liste
s_employe.to_list()

['Ali', 1200.56, 28]

In [56]:
# convertir en dictionnaire
s_employe.to_dict()

{'nom': 'Ali', 'salaire': 1200.56, 'age': 28}

<b>Series pour représenter une série de valeurs</b>

Création

La série est créée comme objet de la classe `pd.Series` en utilisant une liste (comme argument)

Exemple:

    s_ages=pd.Series([28,30,25,41], 
                 index=['Ali','Sonia','Rahma','Walid'], 
                 name='ages', 
                 dtype=np.int16)

In [57]:
import numpy as np
s_ages=#?

Ali      28
Sonia    30
Rahma    25
Walid    41
Name: ages, dtype: int16

Propriétés de Series

In [58]:
s_ages.dtype

dtype('int16')

In [59]:
s_ages.shape

(4,)

Fonctions sur les Series

In [60]:
s_ages.max()

41

In [61]:
s_ages.min()

25

In [62]:
s_ages.mean()

31.0

<b>DataFrame pour représenter une population</b>

Un Dataframe est crée comme un objet de la classe `pd.DataFrame`.
- On peut spécifier les colonnes

Exemple:

    df_employes=pd.DataFrame({'age':[28,30,25,41],'salaire':[1200.65,2100.76,1500.98,2500.76]},
                            index=['Ali','Sonia','Rahma','Walid'])

- On peut spécifier les lignes

Exemple:

    df_employes=pd.DataFrame([[28,1200.65], 
                          [30,2100.76],
                          [25,1500.98], 
                          [41,2500.76]],
                            index=['Ali','Sonia','Rahma','Walid'],
                            columns=['age','salaire'])

Création en spécifiant les colonnes

In [63]:
df_employes=#?

       age  salaire
Ali     28  1200.65
Sonia   30  2100.76
Rahma   25  1500.98
Walid   41  2500.76

Création en spécifiant les lignes

In [64]:
df_employes=#?

       age  salaire
Ali     28  1200.65
Sonia   30  2100.76
Rahma   25  1500.98
Walid   41  2500.76

Propriétés de Dataframe

In [65]:
df_employes.shape

(4, 2)

In [66]:
df_employes.dtypes

age          int64
salaire    float64
dtype: object

In [67]:
df_employes.index

Index(['Ali', 'Sonia', 'Rahma', 'Walid'], dtype='object')

In [68]:
df_employes.columns

Index(['age', 'salaire'], dtype='object')

In [69]:
df_employes.values

array([[  28.  , 1200.65],
       [  30.  , 2100.76],
       [  25.  , 1500.98],
       [  41.  , 2500.76]])

<b>Création d'un dataframe à partir d'un CSV</b>

Utiliser la fonction `pd.read_csv()`

Exemple:

    df_employes=pd.read_csv('employes.csv')

In [139]:
df_employes=#?

     nom  age  salaire
0    Ali   28  1200.65
1  Sonia   30  2100.76
2  Rahma   25  1500.98
3  Walid   41  2500.76

On peut rendre une colonne comme index de dataframe

On utilise la fonction  `set_index()`

Exemple:

    df_employes.set_index('nom')

In [140]:
#?

       age  salaire
nom
Ali     28  1200.65
Sonia   30  2100.76
Rahma   25  1500.98
Walid   41  2500.76

Avec `set_index()` peut mettre à jour le dataframe en spécifiant `inplace=True`

In [72]:
df_employes.set_index('nom', #?)

In [73]:
df_employes

       age  salaire
nom
Ali     28  1200.65
Sonia   30  2100.76
Rahma   25  1500.98
Walid   41  2500.76

Avec `pd.read_csv()`, on peut spécfier la colonne qui joue le role d'index avec l'option `index_col`

Exemple:

    df_employes=pd.read_csv('employes.csv', index_col=0)

In [74]:
df_employes=pd.read_csv('employes.csv', #?)
df_employes

       age  salaire
nom
Ali     28  1200.65
Sonia   30  2100.76
Rahma   25  1500.98
Walid   41  2500.76

On peut remettre à zero l'index avec la fonction `reset_index()`, ainsi, Pandas va :
- Rendre l'index une colonne noramale
- Associe un index automatique nuémrique au dataframe

Exemple:

    df_employes.reset_index(inplace=True)

In [75]:
#?

     nom  age  salaire
0    Ali   28  1200.65
1  Sonia   30  2100.76
2  Rahma   25  1500.98
3  Walid   41  2500.76

<b>Opérations de base sur Series</b>

Indexation

avec indices numériques

In [ ]:
# premiere valeur d'age
s_ages#?

28

In [ ]:
#derniere valeur d'age
s_ages#?

41

Avec les labels

In [103]:
# Age d'Ali
s_ages#?

28

Slicing

In [ ]:
# Les deux premieres valeurs d'age
s_ages#?

Ali      28
Sonia    30
Name: ages, dtype: int16

<b>Opérations de base sur dataframes</b>

Indexation

avec l'opérateur iloc

In [82]:
#premier employé (1ère ligne)
df_employes.#?

age          28.00
salaire    1200.65
Name: Ali, dtype: float64

In [85]:
#ages des employés (1ère colonne)
df_employes.iloc#?

Ali      28
Sonia    30
Name: age, dtype: int64

In [88]:
# Les deux premiers employés
# On utilise les indices [0,1]
df_employes.iloc#?

       age  salaire
Ali     28  1200.65
Sonia   30  2100.76

In [89]:
# Les deux premiers employés
# On utilise le slicing :2
df_employes.iloc#?

       age  salaire
Ali     28  1200.65
Sonia   30  2100.76

avec l'oéprateur loc

In [86]:
# Employé 'Ali' (ligne ayant index='Ali)
df_employes.loc#?

age          28.00
salaire    1200.65
Name: Ali, dtype: float64

In [90]:
# Ages des employés
# Colonne obtenue comme series
df_employes.loc#?

Ali      28
Sonia    30
Name: age, dtype: int64

In [91]:
# Ages des employés
# colonne obtenue comme dataframe
df_employes.loc#?

       age
Ali     28
Sonia   30

In [92]:
# Ages des employés
# Sans loc et sans iloc
df_employes#?

Ali      28
Sonia    30
Name: age, dtype: int64

Filtrage avec loc + slicing

In [93]:
# Extraire les lignes de 'Ali' et 'Sonia'
df_employes.loc#?

       age  salaire
Ali     28  1200.65
Sonia   30  2100.76

In [96]:
# Extraire les colonnes  de 'salaire' et 'age'
df_employes.loc#?

       salaire  age
Ali    1200.65   28
Sonia  2100.76   30

Filtrage avec loc + expression lambda

Exemple:

Pour extraire extraire les employés ayant age<30
    
    df_employes.loc[lambda e : e['age']<30]

In [98]:
# extraire les employés ayant age<30
#?

     age  salaire
Ali   28  1200.65

Exemple:

Extraire les employés ayant age<30 et salaire <2000
Astuce : Utiliser l'opérateur &

    df_employes.loc[lambda e : (e['age']<30) & (e['salaire']<2000)]

In [104]:
# Extraire les employés ayant age<30 et salaire <2000
# Utiliser l'opérateiur &
#?

     age  salaire
Ali   28  1200.65

In [105]:
# Extraire l'age employés ayant age<30 et salaire <2000
# Utiliser l'opérateiur &
df_employes.loc[#?,#?]

Ali    28
Name: age, dtype: int64

Filtrage avec la fonction query

On peut spécifier des conditions de même style que avec WHERE en SQL

On utilise la fonction `query()`

Exemple:

Déterminer les employés les employés ayant age<30 et salaire<2000

    df_employes.query('age<30 and salaire<2000')

In [107]:
#?

     age  salaire
Ali   28  1200.65

Exemple:

Déterminer employés dont l'age est soit 30 soit 40

Utiliser l'opérateur in :

    df_employes.query('age in [30,40]')

In [108]:
# condition avec l'oéprateur "in"
df_employes.query(#?)

       age  salaire
Sonia   30  2100.76

Fonctions sur dataframes

Des fonctions utiles (mean, max, sum, ....) sont associées au dataframe.
- On peut les appeler sans des arguments
- On peut les appeler avec l'argument axis : soit 0 pour faire le calcul sur l'axe vertical soit 1 pour que le calcul soit sur l'axe horizontale

In [117]:
df_employes.mean() # non pertinente généralement

age          29.000
salaire    1650.705
dtype: float64

In [118]:
df_employes.mean(axis=0) # La moyenne par propriété/colonne (pertinent)

age          29.000
salaire    1650.705
dtype: float64

<b>Exercice:</b>

In [129]:
df_employes=pd.read_csv('employes2.csv', index_col=0)
df_employes

         age departement  salaire
nom
Alice     30          RH    50000
Bob       25   Marketing    60000
Charlie   35     Finance    70000
David     40          IT    80000
Eve       28          RH    55000

Extraire Age et Salaire de deux derniers employés

In [135]:
#?

       age departement  salaire
nom
David   40          IT    80000
Eve     28          RH    55000

Les employes de departement RH

In [132]:
#?

       age departement  salaire
nom
Alice   30          RH    50000
Eve     28          RH    55000

L'age moyen des employés de departement RH

In [134]:
#?

52500.0